app/Controllers/Announcement.php

SELECT *
FROM `announcements`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $model = new AnnouncementModel();
        $data['announcements'] = $model->orderBy('created_at', 'DESC')->findAll();