app/Controllers/Auth.php

    public function login()
    {
        if (session()->get('logged_in')) {
            return redirect()->to('/dashboard');
        }

        if ($this->request->getMethod() === 'POST') {
            $userModel = new UserModel();
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'student@example.com'
 LIMIT 1

    public function dashboard()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login')->with('error', 'Please login first.');
        }

        $role = session()->get('role');
        $name = session()->get('username');

        $data = [
            'role' => $role,
            'name' => $name,
        ];

        // ✅ Load announcements without relying on missing models
        $announcementModel = new \App\Models\AnnouncementModel();
        $data['announcements'] = $announcementModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `announcements`
ORDER BY `created_at` DESC